"""Завдання 1"""
"""Вивести натуральні числа від 0 до 20 в термінал/консоль"""
print(list(range(21)))
n = 20
for i in range(n+1):
    print(i)

"""Завдання 2"""
"""Вивести натуральні числа від -10 до 10 в термінал/консоль"""
for i in range(-10, 11):
    print(i)

"""Завдання 3"""
"""З використанням циклів добийтесь наступного результату в терміналі/консолі
1 
1 2 
1 2 3 
1 2 3 4 
1 2 3 4 5"""
n = 7
for i in range(1, n+1):
    for j in range(1, i+1):
        print(j, end=' ')
    print('')

"""Додатково"""
"""У Вас є наступний список"""
"""data = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]"""
"""З використанням циклк добийтеся того, щоб в терміналі/консолі вивелись лише елементи з парним індексом"""
"""20 40 60 80 100"""

list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
for i in list:
    if i % 20 == 0:
        print(i)
